2022-11-03.org
#+title: Blackerby Sub Plans, November 3, 2022
#+options: toc:nil <:t

* [[#b-block][B Block]]
:PROPERTIES:
:CUSTOM_ID: b-block
:END:
- *Course Title*: AP Latin
- *Date*:     [2022-11-03 Thurs]
- *Location*: 4S
- *Coverer*:  [[mailto:weslie.wald@indiansprings.org][Weslie Wald]]
- *Notes*:    attendance only
- *Time*:     8:20 AM
** Roster
| last      | first  | grade      | class    | email                            |
| Graham    | Sophia | 11th Grade | AP Latin | sophia.graham@indiansprings.org  |
| Li        | Olivia | 12th Grade | AP Latin | olivia.li@indiansprings.org      |
| Meghani   | Misbah | 11th Grade | AP Latin | misbah.meghani@indiansprings.org |
| Underwood | Mark   | 12th Grade | AP Latin | mark.underwood@indiansprings.org |
| Xiao      | Enoch  | 12th Grade | AP Latin | enoch.xiao@indiansprings.org     |
| Zhao      | Frank  | 12th Grade | AP Latin | frank.zhao@indiansprings.org     |

** Assignment
Prepare DBG 6.13 for translation in class on Monday, November 7.  Mega vocab check!

* [[#c-block][C Block]]
:PROPERTIES:
:CUSTOM_ID: c-block
:END:
- *Course Title*: Latin II
- *Date*:     [2022-11-03 Thurs]
- *Location*: 15
- *Coverer*:  [[mailto:neil.barrett@indiansprings.org][Neil Barrett]]
- *Time*:     9:15 AM
** Roster
| last       | first       | grade      | class    | email                                |
| Albert     | Nate        | 10th Grade | Latin II | nate.albert@indiansprings.org        |
| Cai        | Chenrui     | 10th Grade | Latin II | chenrui.cai@indiansprings.org        |
| Garrett    | Tatum       | 11th Grade | Latin II | tatum.garrett@indiansprings.org      |
| Lacy       | Robin       | 10th Grade | Latin II | robin.lacy@indiansprings.org         |
| Rominger   | Etta        | 10th Grade | Latin II | etta.rominger@indiansprings.org      |
| Rosenstiel | Frances     | 10th Grade | Latin II | frances.rosenstiel@indiansprings.org |
| Spensley   | Jupiter     | 9th Grade  | Latin II | emm.spensley@indiansprings.org       |
| Sutton     | Ann Charles | 10th Grade | Latin II | anncharles.sutton@indiansprings.org  |
| Waara      | Jett        | 9th Grade  | Latin II | jett.waara@indiansprings.org         |

** Assignment
Read pages 120 and 121 in the textbook.  Translate the story on page 122.  When you have completed this assignment, you may quietly work on something for another class.

* [[#d-block][D Block]]
:PROPERTIES:
:CUSTOM_ID: d-block
:END:
- *Course Title*: Intro to Ancient Greek
- *Date*:     [2022-11-03 Thurs]
- *Location*: 4S
- *Coverer*:  [[mailto:ccopeland@indiansprings.org][Christine Copeland]]
- *Notes*:    attendance only
- *Time*:     10:10 AM
** Roster
| last      | first      | grade      | class | email                                  |
| Friedrich | Konstantin | 10th Grade | Greek | konstantin.friedrich@indiansprings.org |
| Goodrich  | Gibson     | 12th Grade | Greek | gibson.goodrich@indiansprings.org      |
| Jetty     | Naren      | 12th Grade | Greek | naren.jetty@indiansprings.org          |
| Kurre     | Santo      | 12th Grade | Greek | santo.kurre@indiansprings.org          |
| Oates     | Teddy      | 12th Grade | Greek | teddy.oates@indiansprings.org          |
| Shoreibah | Nour       | 12th Grade | Greek | nour.shoreibah@indiansprings.org       |
| Su        | Yvonne     | 12th Grade | Greek | yvonne.su@indiansprings.org            |
| Wallwork  | Carlton    | 12th Grade | Greek | carlton.wallwork@indiansprings.org     |

** Assignment
- Read page 81 in the textbook.
- Complete exercise 5η on page 82.
- Translate the story at the bottom of page 82.

* [[#e-block][E Block]]
:PROPERTIES:
:CUSTOM_ID: e-block
:END:
- *Course Title*: Latin IV
- *Date*:     [2022-11-03 Thurs]
- *Location*: 4S
- *Coverer*:  [[mailto:clay.colvin@indiansprings.org][Clay Colvin]]
- *Notes*:    attendance only
- *Time*:     12:25 PM
** Roster
| last    | first      | grade      | class    | email                               |
| Bai     | Sasha      | 12th Grade | Latin IV | sasha.bai@indiansprings.org         |
| Grayson | Mary Helen | 11th Grade | Latin IV | maryhelen.grayson@indiansprings.org |
| Otter   | Skye       | 11th Grade | Latin IV | skye.otter@indiansprings.org        |
| Thomson | Matthew    | 11th Grade | Latin IV | matthew.thomson@indiansprings.org   |
| Wang    | Walter     | 11th Grade | Latin IV | walter.wang@indiansprings.org       |

** Assignment
Begin translating the Chapter 10 story (page 226 in the second edition of the textbook).

* [[#advisory][Advisory]]
:PROPERTIES:
:CUSTOM_ID: advisory
:END:
- *Course Title*: Advisory
- *Date*:     [2022-11-03 Thurs]
- *Location*: 12
- *Coverer*:  [[mailto:jhorn@indiansprings.org][Jonathan Horn]]
- *Time*:     2:15 PM
** Roster
| last     | first     | grade      | class    | email                               |
| Barton   | Nora      | 12th Grade | Advisory | nora.barton@indiansprings.org       |
| Dunbar   | Mays      | 11th Grade | Advisory | mays.dunbar@indiansprings.org       |
| Giattina | William   | 11th Grade | Advisory | william.giattina@indiansprings.org  |
| Impello  | Laurel    | 12th Grade | Advisory | laurel.impello@indiansprings.org    |
| Nakano   | Yuji      | 12th Grade | Advisory | yuji.nakano@indiansprings.org       |
| Rutledge | Emma Cate | 12th Grade | Advisory | emmacate.rutledge@indiansprings.org |
| Sabel    | Rosa      | 12th Grade | Advisory | rosa.sabel@indiansprings.org        |
| Wallwork | Carlton   | 12th Grade | Advisory | carlton.wallwork@indiansprings.org  |
| Wilder   | Henry     | 11th Grade | Advisory | henry.wilder@indiansprings.org      |

** Assignment
See email from Anne Burruss.

* [[#g-block][G Block]]
:PROPERTIES:
:CUSTOM_ID: g-block
:END:
- *Course Title*: Latin I
- *Date*:     [2022-11-03 Thurs]
- *Location*: 8
- *Coverer*:  [[mailto:ccopeland@indiansprings.org][Christine Copeland]]
- *Time*:     2:50 PM
** Roster
| last          | first   | grade      | class   | email                                |
| Ahn           | Roy     | 9th Grade  | Latin I | roy.ahn@indiansprings.org            |
| Chen          | Molly   | 12th Grade | Latin I | molly.chen@indiansprings.org         |
| Christenberry | Gali    | 8th Grade  | Latin I | gali.christenberry@indiansprings.org |
| Coleman       | Mason   | 11th Grade | Latin I | mason.coleman@indiansprings.org      |
| Girkin        | Silas   | 8th Grade  | Latin I | silas.girkin@indiansprings.org       |
| Lin           | Leo     | 11th Grade | Latin I | leo.lin@indiansprings.org            |
| McLean        | Collin  | 8th Grade  | Latin I | collin.mclean@indiansprings.org      |
| Mehra         | Milan   | 9th Grade  | Latin I | milan.mehra@indiansprings.org        |
| Moran         | Sav     | 8th Grade  | Latin I | sav.moran@indiansprings.org          |
| Morris        | Amelia  | 9th Grade  | Latin I | amelia.morris@indiansprings.org      |
| Myers         | Breyana | 10th Grade | Latin I | breyana.myers@indiansprings.org      |
| Roberts       | Rachel  | 9th Grade  | Latin I | rachel.roberts@indiansprings.org     |
| Seidel        | Kate    | 9th Grade  | Latin I | kate.seidel@indiansprings.org        |
| Shen          | Lillian | 9th Grade  | Latin I | lillian.shen@indiansprings.org       |
| Wilder        | Charlie | 12th Grade | Latin I | charlie.wilder@indiansprings.org     |

** Assignment
Continue working on the packet you received in class yesterday.
- Read the "About the language" information on page 45.
- Complete the exercise on page 46.
- Translate the story on page 47.

When you have finished the packet, you may quietly work on something for another class.  You do not need to finish the packet over the weekend if you don't complete it in class.
