2022-11-03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-02 Wed 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blackerby Sub Plans, November 3, 2022</title>
<meta name="author" content="William Blackerby" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Blackerby Sub Plans, November 3, 2022</h1>

<div id="outline-container-b-block" class="outline-2">
<h2 id="b-block"><span class="section-number-2">1.</span> <a href="#b-block">B Block</a></h2>
<div class="outline-text-2" id="text-b-block">
<ul class="org-ul">
<li><b>Course Title</b>: AP Latin</li>
<li><b>Date</b>:     <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu]</span></span></li>
<li><b>Location</b>: 4S</li>
<li><b>Coverer</b>:  <a href="mailto:weslie.wald@indiansprings.org">Weslie Wald</a></li>
<li><b>Notes</b>:    attendance only</li>
<li><b>Time</b>:     8:20 AM</li>
</ul>
</div>
<div id="outline-container-orgbcd2b2f" class="outline-3">
<h3 id="orgbcd2b2f"><span class="section-number-3">1.1.</span> Assignment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Prepare DBG 6.13 for translation in class on Monday, November 7.  Mega vocab check!
</p>
</div>
</div>
</div>

<div id="outline-container-c-block" class="outline-2">
<h2 id="c-block"><span class="section-number-2">2.</span> <a href="#c-block">C Block</a></h2>
<div class="outline-text-2" id="text-c-block">
<ul class="org-ul">
<li><b>Course Title</b>: Latin II</li>
<li><b>Date</b>:     <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu]</span></span></li>
<li><b>Location</b>: 15</li>
<li><b>Coverer</b>:  <a href="mailto:neil.barrett@indiansprings.org">Neil Barrett</a></li>
<li><b>Time</b>:     9:15 AM</li>
</ul>
</div>
<div id="outline-container-orgbd976c0" class="outline-3">
<h3 id="orgbd976c0"><span class="section-number-3">2.1.</span> Assignment</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Read pages 120 and 121 in the textbook.  Translate the story on page 122.  When you have completed this assignment, you may quietly work on something for another class.
</p>
</div>
</div>
</div>

<div id="outline-container-d-block" class="outline-2">
<h2 id="d-block"><span class="section-number-2">3.</span> <a href="#d-block">D Block</a></h2>
<div class="outline-text-2" id="text-d-block">
<ul class="org-ul">
<li><b>Course Title</b>: Intro to Ancient Greek</li>
<li><b>Date</b>:     <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu]</span></span></li>
<li><b>Location</b>: 4S</li>
<li><b>Coverer</b>:  <a href="mailto:ccopeland@indiansprings.org">Christine Copeland</a></li>
<li><b>Notes</b>:    attendance only</li>
<li><b>Time</b>:     10:10 AM</li>
</ul>
</div>
<div id="outline-container-orgdf5cb29" class="outline-3">
<h3 id="orgdf5cb29"><span class="section-number-3">3.1.</span> Assignment</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Read page 81 in the textbook.</li>
<li>Complete exercise 5η on page 82.</li>
<li>Translate the story at the bottom of page 82.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-e-block" class="outline-2">
<h2 id="e-block"><span class="section-number-2">4.</span> <a href="#e-block">E Block</a></h2>
<div class="outline-text-2" id="text-e-block">
<ul class="org-ul">
<li><b>Course Title</b>: Latin IV</li>
<li><b>Date</b>:     <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu]</span></span></li>
<li><b>Location</b>: 4S</li>
<li><b>Coverer</b>:  <a href="mailto:clay.colvin@indiansprings.org">Clay Colvin</a></li>
<li><b>Notes</b>:    attendance only</li>
<li><b>Time</b>:     12:25 PM</li>
</ul>
</div>
<div id="outline-container-org264b30b" class="outline-3">
<h3 id="org264b30b"><span class="section-number-3">4.1.</span> Assignment</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Begin translating the Chapter 10 story (page 226 in the second edition of the textbook).
</p>
</div>
</div>
</div>

<div id="outline-container-advisory" class="outline-2">
<h2 id="advisory"><span class="section-number-2">5.</span> <a href="#advisory">Advisory</a></h2>
<div class="outline-text-2" id="text-advisory">
<ul class="org-ul">
<li><b>Course Title</b>: Advisory</li>
<li><b>Date</b>:     <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu]</span></span></li>
<li><b>Location</b>: 12</li>
<li><b>Coverer</b>:  <a href="mailto:jhorn@indiansprings.org">Jonathan Horn</a></li>
<li><b>Time</b>:     2:15 PM</li>
</ul>
</div>
<div id="outline-container-orgeed4514" class="outline-3">
<h3 id="orgeed4514"><span class="section-number-3">5.1.</span> Assignment</h3>
<div class="outline-text-3" id="text-5-1">
<p>
See email from Anne Burruss.
</p>
</div>
</div>
</div>

<div id="outline-container-g-block" class="outline-2">
<h2 id="g-block"><span class="section-number-2">6.</span> <a href="#g-block">G Block</a></h2>
<div class="outline-text-2" id="text-g-block">
<ul class="org-ul">
<li><b>Course Title</b>: Latin I</li>
<li><b>Date</b>:     <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu]</span></span></li>
<li><b>Location</b>: 8</li>
<li><b>Coverer</b>:  <a href="mailto:ccopeland@indiansprings.org">Christine Copeland</a></li>
<li><b>Time</b>:     2:50 PM</li>
</ul>
</div>
<div id="outline-container-orgf1088a6" class="outline-3">
<h3 id="orgf1088a6"><span class="section-number-3">6.1.</span> Assignment</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Continue working on the packet you received in class yesterday.
</p>
<ul class="org-ul">
<li>Read the "About the language" information on page 45.</li>
<li>Complete the exercise on page 46.</li>
<li>Translate the story on page 47.</li>
</ul>

<p>
When you have finished the packet, you may quietly work on something for another class.  You do not need to finish the packet over the weekend if you don't complete it in class.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: William Blackerby</p>
<p class="date">Created: 2022-11-02 Wed 15:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
